InformationRegisters/ЗагрузкаКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗагрузкаКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьКомментария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьКомментарияКандидата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗагрузкиКандидатовИзИнтернета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДоступаКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКандидата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗагрузкаКандидатовИзИнтернета/Forms/НеЗагруженныеКандидаты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Пользователь", Пользователи.АвторизованныйПользователь());
	УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Истина);
	УстановитьУсловноеОформление();
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(
		ЭтотОбъект, "Список.ДатаСостояния", Элементы.СписокДатаСостояния.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНеЗагруженногоКандидата(Элементы.Список.ТекущиеДанные.Идентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьОтложенных(Команда)
	ТекущееСостояние = Не Элементы.СписокПоказыватьОтложенных.Пометка;
	УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Не ТекущееСостояние);
	Элементы.СписокПоказыватьОтложенных.Пометка = ТекущееСостояние;
	Элементы.СписокКонтекстноеМенюПоказыватьОтложенных.Пометка = ТекущееСостояние;
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	НачатьУстановкуПометкиОтложенаВыделенныхСтрок();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Использование)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Отложена", Ложь, , , Использование);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНеЗагруженногоКандидата(Идентификатор)
	ОткрытьФорму("РегистрСведений.ЗагрузкаКандидатовИзИнтернета.Форма.НеЗагруженныйКандидат", 
		Новый Структура("Идентификатор", Идентификатор), ЭтотОбъект, Идентификатор);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Отложенных показывать серым цветом.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Список");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "Список.Отложена", Истина);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуПометкиОтложенаВыделенныхСтрок()

	Идентификаторы = Новый Массив;

	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Идентификатор);
	КонецЦикла;

	Если Идентификаторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ДлительнаяОперацияУстановкиПометкиОтложена(Идентификаторы, ЭтотОбъект.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Установка пометки Отложена'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Загрузки отложены'");
	ПараметрыОжидания.ОповещениеПользователя.Пояснение = 
		НСтр("ru = 'Теперь их можно увидеть по команде «Показывать отложенные»'");

	ДополнительныеПараметры = Новый Структура("ОтложенныеЗаписи", Элементы.Список.ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьУстановкуПометкиОтложенаВыделенныхСтрок", 
		ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуПометкиОтложенаВыделенныхСтрок(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;

	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ДополнительныеПараметры.ОтложенныеЗаписи);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияУстановкиПометкиОтложена(ИдентификаторыЗагрузок, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Установка пометки Отложена для загрузок кандидатов из Интернета'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.ОтложитьЗагрузкиКандидатов", ИдентификаторыЗагрузок);
	
КонецФункции

#КонецОбласти
